# Docker and Kubernetes
brew "docker"
brew "docker-compose"
brew "docker-slim"
brew "dive"
brew "lazydocker"
brew "ctop"
brew "kubectl"
brew "kubectx"
brew "helm"
brew "kind"

# DevOps and Infrastructure
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"
brew "aquasecurity/trivy/trivy"

# General Utilities
brew "jq"
brew "yq"
brew "tldr"
brew "fzf"
brew "bat"
brew "htop"
brew "glow"

# Git
brew "diff-so-fancy"
brew "lazygit"

# Networking
brew "httpie"
cask "ngrok"
brew "wireshark"
brew "iftop"

# Database Tools
brew "pgcli"
brew "redis"
brew "mongosh"
